; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob7390) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate8)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate2)
	(at pallet5 distributor2)
	(clear crate7)
	(at pallet6 depot1)
	(clear crate9)
	(at pallet7 depot1)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear crate11)
	(at truck0 depot2)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(at crate1 depot1)
	(on crate1 pallet6)
	(at crate2 distributor1)
	(on crate2 crate0)
	(at crate3 distributor2)
	(on crate3 pallet5)
	(at crate4 depot0)
	(on crate4 pallet0)
	(at crate5 depot1)
	(on crate5 crate1)
	(at crate6 depot1)
	(on crate6 crate5)
	(at crate7 distributor2)
	(on crate7 crate3)
	(at crate8 depot0)
	(on crate8 crate4)
	(at crate9 depot1)
	(on crate9 crate6)
	(at crate10 distributor0)
	(on crate10 pallet9)
	(at crate11 distributor0)
	(on crate11 crate10)
)

(:goal (and
		(on crate0 crate2)
		(on crate2 pallet6)
		(on crate3 crate6)
		(on crate4 crate8)
		(on crate5 crate4)
		(on crate6 pallet5)
		(on crate8 pallet8)
		(on crate9 pallet0)
		(on crate10 crate0)
		(on crate11 pallet1)
	)
))

; plan
1. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 0 of 10
2. (lift hoist3 crate11 crate10 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist3) (on crate11 crate10)
   added: (lifting hoist3 crate11) (clear crate10)
   goals met: 0 of 10
3. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 0 of 10
4. (lift hoist4 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist4) (on crate2 crate0)
   added: (lifting hoist4 crate2) (clear crate0)
   goals met: 0 of 10
5. (lift hoist0 crate8 crate4 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate4)
   added: (lifting hoist0 crate8) (clear crate4)
   goals met: 0 of 10
6. (load hoist0 crate8 truck1 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck1) (available hoist0)
   goals met: 0 of 10
7. (lift hoist1 crate9 crate6 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist1) (on crate9 crate6)
   added: (lifting hoist1 crate9) (clear crate6)
   goals met: 0 of 10
8. (load hoist1 crate9 truck0 depot1)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   goals met: 0 of 10
9. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 0 of 10
10. (load hoist3 crate11 truck0 distributor0)
   deleted: (lifting hoist3 crate11)
   added: (in crate11 truck0) (available hoist3)
   goals met: 0 of 10
11. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 0 of 10
12. (load hoist4 crate2 truck0 distributor1)
   deleted: (lifting hoist4 crate2)
   added: (in crate2 truck0) (available hoist4)
   goals met: 0 of 10
13. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 0 of 10
14. (unload hoist1 crate11 truck0 depot1)
   deleted: (in crate11 truck0) (available hoist1)
   added: (lifting hoist1 crate11)
   goals met: 0 of 10
15. (drop hoist1 crate11 pallet1 depot1)
   deleted: (lifting hoist1 crate11) (clear pallet1)
   added: (available hoist1) (at crate11 depot1) (clear crate11) (on crate11 pallet1)
   goals met: 1 of 10
16. (lift hoist1 crate6 crate5 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 crate5)
   added: (lifting hoist1 crate6) (clear crate5)
   goals met: 1 of 10
17. (load hoist1 crate6 truck0 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   goals met: 1 of 10
18. (lift hoist1 crate5 crate1 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   goals met: 1 of 10
19. (load hoist1 crate5 truck0 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   goals met: 1 of 10
20. (unload hoist1 crate2 truck0 depot1)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   goals met: 1 of 10
21. (drop hoist1 crate2 crate11 depot1)
   deleted: (lifting hoist1 crate2) (clear crate11)
   added: (available hoist1) (at crate2 depot1) (clear crate2) (on crate2 crate11)
   goals met: 1 of 10
22. (lift hoist1 crate1 pallet6 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet6)
   added: (lifting hoist1 crate1) (clear pallet6)
   goals met: 1 of 10
23. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 1 of 10
24. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 1 of 10
25. (unload hoist5 crate8 truck1 distributor2)
   deleted: (in crate8 truck1) (available hoist5)
   added: (lifting hoist5 crate8)
   goals met: 1 of 10
26. (drop hoist5 crate8 pallet8 distributor2)
   deleted: (lifting hoist5 crate8) (clear pallet8)
   added: (available hoist5) (at crate8 distributor2) (clear crate8) (on crate8 pallet8)
   goals met: 2 of 10
27. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 2 of 10
28. (lift hoist3 crate10 pallet9 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist3) (on crate10 pallet9)
   added: (lifting hoist3 crate10) (clear pallet9)
   goals met: 2 of 10
29. (load hoist3 crate10 truck1 distributor0)
   deleted: (lifting hoist3 crate10)
   added: (in crate10 truck1) (available hoist3)
   goals met: 2 of 10
30. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 2 of 10
31. (unload hoist4 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist4)
   added: (lifting hoist4 crate10)
   goals met: 2 of 10
32. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 2 of 10
33. (unload hoist5 crate6 truck0 distributor2)
   deleted: (in crate6 truck0) (available hoist5)
   added: (lifting hoist5 crate6)
   goals met: 2 of 10
34. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 2 of 10
35. (lift hoist0 crate4 pallet0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 pallet0)
   added: (lifting hoist0 crate4) (clear pallet0)
   goals met: 2 of 10
36. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   goals met: 2 of 10
37. (unload hoist0 crate9 truck0 depot0)
   deleted: (in crate9 truck0) (available hoist0)
   added: (lifting hoist0 crate9)
   goals met: 2 of 10
38. (drop hoist0 crate9 pallet0 depot0)
   deleted: (lifting hoist0 crate9) (clear pallet0)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 pallet0)
   goals met: 3 of 10
39. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 3 of 10
40. (drop hoist0 crate4 crate9 depot0)
   deleted: (lifting hoist0 crate4) (clear crate9)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate9)
   goals met: 3 of 10
41. (drop hoist1 crate1 pallet7 depot1)
   deleted: (lifting hoist1 crate1) (clear pallet7)
   added: (available hoist1) (at crate1 depot1) (clear crate1) (on crate1 pallet7)
   goals met: 3 of 10
42. (lift hoist1 crate2 crate11 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 crate11)
   added: (lifting hoist1 crate2) (clear crate11)
   goals met: 3 of 10
43. (drop hoist1 crate2 pallet6 depot1)
   deleted: (lifting hoist1 crate2) (clear pallet6)
   added: (available hoist1) (at crate2 depot1) (clear crate2) (on crate2 pallet6)
   goals met: 4 of 10
44. (drop hoist5 crate6 crate7 distributor2)
   deleted: (lifting hoist5 crate6) (clear crate7)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 crate7)
   goals met: 4 of 10
45. (lift hoist0 crate4 crate9 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate9)
   added: (lifting hoist0 crate4) (clear crate9)
   goals met: 4 of 10
46. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   goals met: 4 of 10
47. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 4 of 10
48. (unload hoist5 crate4 truck0 distributor2)
   deleted: (in crate4 truck0) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 4 of 10
49. (drop hoist5 crate4 crate8 distributor2)
   deleted: (lifting hoist5 crate4) (clear crate8)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 crate8)
   goals met: 5 of 10
50. (unload hoist5 crate5 truck0 distributor2)
   deleted: (in crate5 truck0) (available hoist5)
   added: (lifting hoist5 crate5)
   goals met: 5 of 10
51. (drop hoist5 crate5 crate4 distributor2)
   deleted: (lifting hoist5 crate5) (clear crate4)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 crate4)
   goals met: 6 of 10
52. (lift hoist5 crate6 crate7 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist5) (on crate6 crate7)
   added: (lifting hoist5 crate6) (clear crate7)
   goals met: 6 of 10
53. (drop hoist5 crate6 crate5 distributor2)
   deleted: (lifting hoist5 crate6) (clear crate5)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 crate5)
   goals met: 6 of 10
54. (load hoist4 crate10 truck1 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck1) (available hoist4)
   goals met: 6 of 10
55. (lift hoist4 crate0 pallet4 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 pallet4)
   added: (lifting hoist4 crate0) (clear pallet4)
   goals met: 6 of 10
56. (load hoist4 crate0 truck1 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck1) (available hoist4)
   goals met: 6 of 10
57. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 6 of 10
58. (unload hoist1 crate0 truck1 depot1)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   goals met: 6 of 10
59. (drop hoist1 crate0 crate2 depot1)
   deleted: (lifting hoist1 crate0) (clear crate2)
   added: (available hoist1) (at crate0 depot1) (clear crate0) (on crate0 crate2)
   goals met: 7 of 10
60. (unload hoist1 crate10 truck1 depot1)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   goals met: 7 of 10
61. (drop hoist1 crate10 crate0 depot1)
   deleted: (lifting hoist1 crate10) (clear crate0)
   added: (available hoist1) (at crate10 depot1) (clear crate10) (on crate10 crate0)
   goals met: 8 of 10
62. (lift hoist5 crate7 crate3 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 crate3)
   added: (lifting hoist5 crate7) (clear crate3)
   goals met: 8 of 10
63. (load hoist5 crate7 truck0 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck0) (available hoist5)
   goals met: 8 of 10
64. (lift hoist5 crate3 pallet5 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist5) (on crate3 pallet5)
   added: (lifting hoist5 crate3) (clear pallet5)
   goals met: 8 of 10
65. (load hoist5 crate3 truck0 distributor2)
   deleted: (lifting hoist5 crate3)
   added: (in crate3 truck0) (available hoist5)
   goals met: 8 of 10
66. (lift hoist5 crate6 crate5 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist5) (on crate6 crate5)
   added: (lifting hoist5 crate6) (clear crate5)
   goals met: 8 of 10
67. (drop hoist5 crate6 pallet5 distributor2)
   deleted: (lifting hoist5 crate6) (clear pallet5)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 pallet5)
   goals met: 9 of 10
68. (unload hoist5 crate3 truck0 distributor2)
   deleted: (in crate3 truck0) (available hoist5)
   added: (lifting hoist5 crate3)
   goals met: 9 of 10
69. (drop hoist5 crate3 crate6 distributor2)
   deleted: (lifting hoist5 crate3) (clear crate6)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 crate6)
   goals met: 10 of 10
